---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetClosedLoopInSketch
source: html/578f5afd-ec61-542d-7b2c-203a47d88b36.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SketchFailures.BentFabricSheetClosedLoopInSketch Property

The bend profile cannot contain a closed loop. Click Continue to correct the profile or Click Quit sketching to exit the bend profile editor.

## Syntax (C#)
```csharp
public static FailureDefinitionId BentFabricSheetClosedLoopInSketch { get; }
```